{
  "target_groupings": {
    "geographical or political entity": {
      "groups": [
        {
          "name": "Specific Lands & Defined Regions",
          "description": "Identifiable geographical areas, districts, or national lands, often with specific biblical significance (e.g., Promised Land, Edom).",
          "members": [
            "Argob district",
            "Argob district/portion of land",
            "His people's land",
            "The Promised Land (Canaan)",
            "The land (of Canaan)",
            "The land of Canaan",
            "The land of Edom (specifically, the portion of it that Israel might possess)",
            "The land of Israel",
            "the entire northern region of the land of Israel",
            "the promised land",
            "the territory/region of Edom"
          ],
          "rationale": "These targets refer to distinct, named geographical territories or regions, often with a particular significance (promised, possessed, etc.) within the biblical narrative."
        },
        {
          "name": "Cities, Towns & Communities",
          "description": "Human habitations, from individual cities/towns to collections of them, including their inhabitants or governing structures.",
          "members": [
            "Cities/settlements",
            "City/settlement",
            "Israelite towns/settlements",
            "The cities/settlements of the Israelites",
            "The cities/towns of the Israelites",
            "The city and its inhabitants",
            "The towns/settlements/communities of the Israelites",
            "cities/settlements of Israel",
            "communities/cities within the land",
            "settlements or cities of Israel",
            "settlements/cities",
            "the cities/settlements of Israel",
            "the cities/towns of the Israelites and their inhabitants",
            "the city",
            "the city's legal system or courts",
            "the city/settlement",
            "the city/town",
            "the community or city",
            "the entire community/city",
            "the town (עִיר)"
          ],
          "rationale": "This group encompasses all forms of human settlements, from singular cities/towns to collective communities, and includes references to their populations or administrative aspects."
        },
        {
          "name": "Political Entities & General Landscapes",
          "description": "Broader political entities (nations, kingdoms, realms) encompassing land, people, and power, as well as general, undifferentiated concepts of 'land' or 'wilderness,' including land described by its state or condition.",
          "members": [
            "Egypt (representing the experience of slavery)",
            "Egypt as the place of Israel's servitude",
            "Sihon's entire kingdom (king, people, army, land)",
            "The inhabitants and political system of Egypt",
            "The nations",
            "The country/nation (Egypt or surrounding nations)",
            "the enemy king, his troops, and his country",
            "the entire Egyptian realm (people, resources, government)",
            "the invading nation",
            "the nations (their existence/power)",
            "the land",
            "the wilderness/land",
            "the wilderness/waste",
            "The future devastated land (its condition of destruction)"
          ],
          "rationale": "This group combines large-scale political entities (nations, kingdoms) that often include land, people, and governance, with more general or abstract references to 'land' or 'wilderness,' and land defined by its condition rather than a specific name."
        },
        {
          "name": "Spatial Scope & Relational Concepts",
          "description": "Abstract spatial concepts, including cardinal directions, the relative positioning of entities, and the overall scope or extent of a geographical area or influence, up to a global scale.",
          "members": [
            "The direction \"west\"",
            "spatial relationship of dispossessed nations to Israelites",
            "spatial relationship of the nations to the Israelites",
            "the cardinal direction 'east'",
            "the entire spatial extent/scope",
            "the entire earth/world",
            "the entire world/all places on Earth",
            "the extent of the dispersion of the Israelites",
            "the extent of the peoples affected",
            "the geographical scope from which other gods might come",
            "the location of the dispersed Israelites"
          ],
          "rationale": "These targets deal with abstract spatial ideas, such as directions, the extent or range of something, and the relational positioning of groups or places, often on a broad or universal scale."
        },
        {
          "name": "Natural Features & Specific Landmarks",
          "description": "Distinct natural geographical features (e.g., mountains, valleys, wadis, rocks) or specific points/lines on the landscape, including their relative positions.",
          "members": [
            "The boundary/edge of the Arnon valley",
            "The rocks of the land",
            "The summit of Mount Pisgah",
            "the wadi Jabbok's extent/side",
            "the position of Mount Nebo relative to Jericho"
          ],
          "rationale": "This group focuses on concrete, identifiable natural elements of the landscape or specific points of interest, including their boundaries or relative locations."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Targets were initially categorized based on their primary semantic focus (e.g., specific named places, types of settlements, political entities, abstract spatial concepts, natural features). These initial categories were then refined and consolidated to meet the 3-6 group requirement, ensuring each target was placed in the most semantically appropriate group while maintaining clear and intuitive distinctions for visualization."
    },
    "time": {
      "groups": [
        {
          "name": "Specific Moments & Brief Periods",
          "description": "Time markers that denote a precise point or a short, clearly defined span.",
          "members": [
            "sundown",
            "sundown/sunset",
            "the specific day",
            "deadline for payment"
          ],
          "rationale": "These targets represent either an exact moment in time (like sundown) or a very short, clearly delimited period (like a specific day or a payment deadline), serving as precise temporal markers."
        },
        {
          "name": "Future & Enduring Time",
          "description": "Periods of time yet to come, including those with ultimate, theological significance.",
          "members": [
            "The future",
            "The future/eschatological period"
          ],
          "rationale": "Both targets explicitly refer to time beyond the present, with 'eschatological' specifically pointing to the ultimate future in a biblical and theological context."
        },
        {
          "name": "Durations of Human Experience & Social Conditions",
          "description": "The length of time associated with various human conditions, emotions, prohibitions, or social states.",
          "members": [
            "Duration of the prohibition for the individual",
            "duration of prohibition",
            "duration of suffering",
            "duration of terror",
            "duration of lack of hatred/enmity",
            "duration of the lack of enmity",
            "the duration of the lack of enmity",
            "duration of remembrance"
          ],
          "rationale": "These targets all describe the temporal extent of human-centric states, whether they are personal experiences (suffering, terror, remembrance) or societal/legal conditions (prohibitions, lack of enmity)."
        },
        {
          "name": "Durations of Divine Engagement",
          "description": "The temporal extent of God's attributes, actions, or relationship with humanity.",
          "members": [
            "duration of God's faithfulness",
            "the duration of God's attention and care"
          ],
          "rationale": "These targets specifically refer to the enduring nature of God's character and active involvement, highlighting divine attributes and their temporal persistence in relation to creation and covenant."
        },
        {
          "name": "Durations of Presence & Tenure",
          "description": "The length of time an entity exists, occupies a place, or holds a specific assignment.",
          "members": [
            "duration of the Esauites' settlement",
            "duration of the Israelites' stay at the mountain",
            "duration of the land's assignment",
            "lifespan of the Israelites"
          ],
          "rationale": "These targets all describe the temporal extent of an entity's physical presence, settlement in a location, the period for which something is assigned, or the overall existence of a group."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Targets were analyzed for their core temporal meaning and the nature of the entity or state whose duration was being described. Initial broad categories were identified (e.g., specific points, durations, future time) and then refined based on semantic similarity and biblical/theological relationships (e.g., human-centric vs. divine-centric durations, physical presence vs. abstract states) to create distinct, semantically coherent groups, ensuring all targets were included and groups met minimum size requirements."
    },
    "state of being": {
      "groups": [
        {
          "name": "Existence & Duration",
          "description": "States related to being alive, the length of life, presence, and continuity in time or space.",
          "members": [
            "Aaron's death",
            "Moses's death",
            "Lifespan/longevity",
            "The Israelites' existence/longevity",
            "longevity/lifespan",
            "longevity/long life",
            "lifespan and presence in the land",
            "longevity and continued existence of the Israelites",
            "duration of stay/life in the land",
            "duration of Israel's presence and prosperity in the land",
            "person's existence, legacy, or memory",
            "your life",
            "the entirety of one's life and activities",
            "slave's legal status/duration of service",
            "Israelite presence/path"
          ],
          "rationale": "These targets all describe aspects of being, living, or the temporal extent and continuity of existence, whether for individuals, a nation, or a specific status."
        },
        {
          "name": "Well-being & Provision",
          "description": "Positive states of flourishing, sustenance, security, and a stable domestic environment.",
          "members": [
            "economic well-being; food provision; sustenance",
            "prosperity and sustenance",
            "security/protection",
            "well-being and prosperity of the Israelites",
            "divine support and protection for the Israelites",
            "domestic life/home/household"
          ],
          "rationale": "This group captures various forms of positive 'state of being' related to material, physical, and communal flourishing, often implying divine favor or a settled, secure condition."
        },
        {
          "name": "Adversity & Affliction",
          "description": "Negative states of suffering, hardship, misfortune, distress, and the consequences of curses or judgment.",
          "members": [
            "Misfortune/evil consequences",
            "The afflictions/curses (consumption, fever, sword, etc.)",
            "affliction/distress during the Exodus",
            "calamity, panic, frustration",
            "exile, captivity, or misfortune of the Israelites",
            "occurrence of negative events/circumstances",
            "profound and unceasing distress",
            "sicknesses",
            "the experience of negative circumstances (evils and troubles)",
            "the incurability of the affliction",
            "Utter desolation/absence of people",
            "the comprehensiveness or pervasiveness of the curse"
          ],
          "rationale": "These targets uniformly describe various forms of negative experiences, suffering, and undesirable conditions, often as a result of divine or natural judgment."
        },
        {
          "name": "Dominion & Servitude",
          "description": "States relating to power, control, victory, or conversely, being under the authority or subjugation of others.",
          "members": [
            "Israel's power/control/victory over Sihon and his land",
            "The Israelites' subjugation to the Amorites",
            "The oppressive system and condition of slavery in Egypt",
            "slavery in Egypt",
            "slavery/servitude in Egypt",
            "the state of slavery or servitude",
            "power/control over enemies",
            "possession and control of the land by the kings",
            "the enemy's strength, vitality, and ability to act"
          ],
          "rationale": "This group focuses on the dynamics of control and lack thereof, encompassing states of dominance, victory, and possession, as well as states of being enslaved or subjected to another's power."
        },
        {
          "name": "Inner States & Relationship",
          "description": "Internal conditions of the mind, will, emotions, and character, including the nature of personal or national relationships.",
          "members": [
            "Complete devotion/commitment",
            "The Israelites' complete devotion and commitment",
            "The Israelites' love for God",
            "Israelites' attention/understanding",
            "The inner person, will, intellect, moral core",
            "The nation's character/disposition",
            "inner emotional state; absence of regret",
            "personal desire or appetite",
            "spiritual unresponsiveness or resistance of the Israelites",
            "the inner disposition or attitude of the individual while serving God",
            "speaker's desire for the Israelites' disposition",
            "the woman's acceptability to the man",
            "God's direct and intimate relationship/communication with Moses"
          ],
          "rationale": "This group captures the internal, subjective states of individuals or the nation, including their moral, intellectual, emotional, and spiritual disposition, as well as the quality of their relationships."
        },
        {
          "name": "Divine & External Conditions",
          "description": "States originating from divine disposition (e.g., anger), objective truths, or imposed external circumstances and judgments.",
          "members": [
            "God's anger/wrath",
            "God's wrath",
            "the blood-avenger's anger",
            "the enemy's anger",
            "destiny",
            "impending future events",
            "the undeniable truth and self-evident nature of the comparison",
            "the public nature of Moses's actions",
            "The difficulties and responsibilities imposed by the people",
            "speaker's approval or judgment"
          ],
          "rationale": "This group encompasses states that are either divine in origin (God's wrath), objective and external (truth, public nature, destiny), or imposed by external forces (enemy anger, difficulties, speaker's judgment)."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Targets were initially scanned for recurring themes related to 'state of being'. These themes were then categorized into broader conceptual groups, focusing on semantic similarity and biblical/theological relevance. Each target was assigned to a single group, ensuring all targets were covered. Group names and descriptions were refined for clarity and intuitiveness, aiming for 3-6 distinct groups with at least two members each."
    },
    "psychological quality": {
      "groups": [
        {
          "name": "Courage & Resolve",
          "description": "The strength of will, bravery, and determination of individuals or groups in the face of challenge or adversity.",
          "members": [
            "The Israelites' courage/morale",
            "courage or morale of comrades",
            "person's courage or resolve",
            "the Israelites' courage and resolve"
          ],
          "rationale": "These targets explicitly refer to the concept of courage, morale, and steadfast resolve, whether for an individual or a collective entity like the Israelites or comrades, representing a psychological state of fortitude."
        },
        {
          "name": "Moral & Volitional Disposition",
          "description": "The inherent character, ethical stance, and underlying will or inclination of an individual or group, often with significant moral implications.",
          "members": [
            "inner moral character of the Israelites",
            "inner thoughts, intentions, and moral disposition of the Israelites",
            "person's disposition/character",
            "person's will or disposition",
            "the people's unyielding will or disobedience",
            "pride/arrogance",
            "the woman's internal disposition of envy, stinginess, or begrudging"
          ],
          "rationale": "This group captures the broader sense of a person's or group's fundamental character, moral leanings, intentions, and the strength or direction of their will, including specific positive or negative dispositions that define their inner being and ethical orientation."
        },
        {
          "name": "Thought & Perception",
          "description": "The cognitive processes of internal reasoning, judgment, understanding, and how one interprets or apprehends reality and forms intentions.",
          "members": [
            "individual judgment/perception",
            "person's internal thought process/self-reassurance",
            "thoughts or intentions",
            "The master's emotional state or perception"
          ],
          "rationale": "These targets all relate to cognitive functions: how individuals think, judge, perceive, and form intentions or internal narratives. 'The master's emotional state or perception' is included due to the strong 'perception' component and the idea of an internal state of apprehension that influences judgment."
        },
        {
          "name": "Affective States & Desires",
          "description": "Specific emotional conditions, capacities for feeling, and strong inclinations or appetites that drive action or experience.",
          "members": [
            "The individual's appetite/desire",
            "capacity for pity/compassion",
            "compassion/inner disposition",
            "fear or intimidation of a person"
          ],
          "rationale": "This group focuses on distinct emotional experiences (like fear and compassion) and fundamental desires or appetites, which are specific affective qualities rather than general character traits or cognitive processes. 'Inner disposition' here refers to the disposition *of* compassion."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Targets were analyzed for their core semantic meaning related to psychological qualities. Four conceptual clusters emerged: those related to courage and resolve, those describing overall moral character and will, those concerning cognitive processes like thought and perception, and those detailing specific emotional states or desires. Targets were then assigned to the most fitting group based on these semantic relationships, ensuring all targets were covered and groups were distinct yet related."
    },
    "legal, religious or moral concept": {
      "groups": [
        {
          "name": "Divine Revelation & Instruction",
          "description": "Concepts related to God's communicated will, laws, teachings, and the act of receiving and internalizing them.",
          "members": [
            "Divine commandments/prescribed way of life",
            "Divine commandments/way of life",
            "Divine commands/will",
            "God's command or decree",
            "God's command/instruction",
            "God's command/word",
            "God's commandments/moral conduct",
            "God's commandments/prescribed way of life",
            "God's commandments/way of life",
            "God's commands, instructions, or divine will",
            "God's commands/instructions",
            "God's commands/instructions/word",
            "God's commands/will",
            "God's message/revelation",
            "God's words and the command for their constant remembrance",
            "God's words and the command to internalize them",
            "The Instruction/Commandment",
            "The Law/Decree (given by God)",
            "The Ten Commandments/Laws",
            "The things/teachings (הדברים)",
            "divine command/instruction",
            "divine command/word",
            "my discourse/teaching",
            "my speech/word",
            "the commandment (its reception and observance)",
            "the commandment/law",
            "the commandments and teachings of the Torah",
            "the command/word of YHWH",
            "The divine command/prohibition",
            "The divine instruction/commandment",
            "The divine message spoken by the prophet",
            "The entire body of the Torah/Teaching",
            "the discourse/speech (its reception and effect)",
            "the divine commands/laws",
            "the instruction/verdict (הַדָּבָר)",
            "the instructions/Torah's authority",
            "the act of internalizing and remembering the divine instructions"
          ],
          "rationale": "These targets all pertain to the various forms and aspects of God's communication to humanity, encompassing His laws, decrees, teachings, and the imperative to remember and obey them."
        },
        {
          "name": "Covenant, Loyalty & Obedience",
          "description": "Concepts defining the relationship between God and Israel, emphasizing faithfulness, allegiance, and the choices involved in upholding the covenant.",
          "members": [
            "Adherence to divine commandments/moral conduct",
            "Loyalty, allegiance, moral direction",
            "Proper relationship with God",
            "The Israelites' covenant loyalty and obedience to God",
            "The Israelites' covenantal relationship and obedience to Yahweh",
            "The choice or the paths/consequences associated with obedience or disobedience",
            "The choices/options (blessing and curse)",
            "The covenant between God and Israel",
            "The establishment of a covenant",
            "The required total devotion and commitment to God",
            "The path of obedience to God's commands",
            "undivided loyalty/integrity towards God",
            "repentance and renewed allegiance to God",
            "the act of establishing a covenant",
            "the covenant and its enduring nature",
            "the covenant/words spoken",
            "paths of obedience or disobedience and their consequences"
          ],
          "rationale": "This group focuses on the dynamic relationship between God and His people, particularly the covenant, the expected human response of loyalty and obedience, and the fundamental choices that define this relationship."
        },
        {
          "name": "Transgression, Guilt & Impurity",
          "description": "Concepts related to sin, moral and ritual violations, the resulting guilt, and the various forms of evil within the community.",
          "members": [
            "Bloodguilt and its consequence for the household",
            "Bloodguilt incurred by the community",
            "Evil within the community",
            "Guilt/culpability for shedding innocent blood",
            "Guilt/defilement from innocent bloodshed",
            "Idolatry/worship of other gods",
            "Illicit marital claim/sexual relations with father's wife",
            "Moral or ritual impropriety/indecency",
            "The act of violating the covenant",
            "Transgression of commandments, adherence to commandments",
            "authority/representation of other gods",
            "bloodguilt/sin requiring atonement",
            "evil",
            "evil (and evil individuals/practices) within the community",
            "evil (moral corruption) within the Israelite community",
            "evil (הָרָ֖ע)",
            "evil (הָרָע) within Israel",
            "evil within the community of Israel",
            "guilt/moral responsibility for shedding innocent life",
            "legal/moral fault or indecency",
            "The memory and worship of foreign gods",
            "violation of the covenant",
            "worship or service of other gods",
            "worshipping other gods (idolatry)",
            "pagan worship sites",
            "the evil (wickedness, wicked individuals) within the community",
            "the corrupting effect of bribes",
            "the act of charging interest",
            "the financial burden of interest",
            "stinginess or lack of generosity"
          ],
          "rationale": "This group encompasses all forms of deviation from divine standards, including moral failings, ritual defilement, idolatry, and the collective or individual guilt that arises from such actions."
        },
        {
          "name": "Divine Judgment & Providence",
          "description": "Concepts related to God's active response to human behavior, including His justice, anger, and the resulting blessings, curses, or promises.",
          "members": [
            "Curses/negative consequences",
            "Divine affliction or judgment",
            "Divine judgment/warfare",
            "God's anger and wrath",
            "God's judgment/moral evaluation",
            "God's judgment/perception/approval",
            "God's justice and judgment",
            "God's moral judgment or evaluation",
            "God's moral judgment/opinion",
            "blessings",
            "curses",
            "divine judgment/awareness of the merit",
            "divine judgment/destructive power",
            "divine promise/oath",
            "The enduring nature of God's kindness (חֶסֶד)",
            "The scope of the blessing",
            "the curse",
            "God's promise/covenant"
          ],
          "rationale": "This group captures the various ways God interacts with humanity based on their actions, delivering both positive outcomes (blessings, kindness, promises) and negative ones (judgment, wrath, curses)."
        },
        {
          "name": "Legal, Social & Ritual Structures",
          "description": "Concepts pertaining to the established frameworks, norms, and processes within Israelite society and religious practice, including justice systems, inheritance, and acts of worship.",
          "members": [
            "Justice, rights",
            "Patrimony / Inherited property",
            "The legal assembly or court",
            "The physical proof of virginity (e.g., blood-stained cloth)",
            "The sacred context and divine approval of the feast",
            "Justice",
            "justice/rights",
            "legal dispute concerning homicide",
            "legal testimony/evidence",
            "moral obligation to act",
            "public assembly or court of justice",
            "reputation/honor of the virgin",
            "spoken vow/promise",
            "testimony/legal basis",
            "The legal case/situation of the betrothed girl's rape",
            "The legal role of the kinsman-redeemer",
            "priestly judicial authority and rulings",
            "individual's personal domain/sphere of responsibility",
            "inheritance portion",
            "basic necessities for life",
            "principle of human sustenance",
            "generosity/willingness to help",
            "divorce",
            "The Levites' inheritance",
            "The deceased brother's legacy, lineage, and remembrance",
            "continuation of the deceased brother's family line and legacy through offspring",
            "The essential nature and reliability of the enemies' deities/sources of power versus Yahweh",
            "their gods (אֱלֹהֵ֑ימוֹ)",
            "God's presence and authority in a designated place of worship",
            "God's designated portion/offerings",
            "The act of bowing in worship to God",
            "The act of presenting an offering to God",
            "plea/words of the righteous"
          ],
          "rationale": "This group brings together the foundational elements that structure Israelite life, covering legal procedures, social responsibilities, inheritance laws, ritual practices, and the conceptual frameworks of divine and human authority."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "An iterative process was used, starting with a comprehensive review of all target entities to identify overarching themes. Initial conceptual groups were drafted based on these themes (e.g., divine commands, sin, justice, worship). Targets were then assigned to the most semantically appropriate group, with continuous refinement of group names, descriptions, and membership to ensure clarity, distinctiveness, and adherence to the 3-6 group limit. Special attention was paid to biblical and theological relationships to ensure intuitive groupings for a Hebrew scholar."
    },
    "created objects": {
      "groups": [
        {
          "name": "False Deities and Idolatrous Objects",
          "description": "Entities or objects created by humans and worshipped as gods, representing a departure from the true God.",
          "members": [
            "Idols/false gods",
            "The golden calf",
            "idols",
            "idols (false gods)",
            "idols / false gods"
          ],
          "rationale": "These targets all refer to objects or concepts of false worship, often condemned in biblical texts as a rejection of YHWH."
        },
        {
          "name": "Tools, Weapons, and Implements",
          "description": "Man-made instruments used for work, defense, or offense.",
          "members": [
            "arrows",
            "sword",
            "iron tool/implement",
            "the ax-head (הַבַּרְזֶל)"
          ],
          "rationale": "These are all practical objects designed for specific tasks, often with implications of power, destruction, labor, or craftsmanship."
        },
        {
          "name": "Agricultural Products and Sustenance",
          "description": "Products derived from farming and animal husbandry, essential for life and often symbolic of blessing or provision.",
          "members": [
            "animals and their products (e.g., sheep, wool, milk)",
            "grain/produce",
            "wine/grape juice",
            "wine/oil"
          ],
          "rationale": "These targets represent the bounty of the land and livestock, crucial for survival and frequently used in offerings, metaphors for prosperity, or judgment."
        },
        {
          "name": "Structures, Boundaries, and Defined Spaces",
          "description": "Physical or conceptual constructs that define, protect, or delineate specific areas or locations.",
          "members": [
            "city walls",
            "The height of the city walls",
            "The front area of the altar",
            "designated area/place"
          ],
          "rationale": "These targets all relate to the demarcation of space, whether for defense (walls), sacred ritual (altar area), or general conceptual location, often carrying symbolic significance."
        },
        {
          "name": "Texts, Songs, and Transmitted Knowledge",
          "description": "Forms of recorded or orally transmitted knowledge, instruction, and artistic expression.",
          "members": [
            "the book of Teaching",
            "the poem",
            "the poem/song",
            "the poem/song (its content and message)"
          ],
          "rationale": "These targets represent different forms of communication and cultural transmission, often carrying significant messages, instructions, or artistic expression within a biblical context."
        },
        {
          "name": "Units of Measurement and Value",
          "description": "Standardized quantities used for assessing value, volume, or weight in commerce and daily life.",
          "members": [
            "measure (ephah)",
            "weight (stone)"
          ],
          "rationale": "Both targets refer to established standards for quantifying goods, essential for economic and social order, and often used metaphorically for justice or fairness."
        }
      ],
      "ungrouped": [
        "forehead",
        "physical signs/evidence of virginity"
      ],
      "confidence": 0.95,
      "methodology": "Targets were iteratively categorized based on semantic similarity, functional relationships, and common biblical usage patterns. Groups were formed with a minimum of two members, and unique targets were placed in the 'ungrouped' category. Group names and rationales were refined to enhance clarity for visualization."
    },
    "God": {
      "groups": [
        {
          "name": "The Divine Being & Essence",
          "description": "Refers to God's names, fundamental identity, and inherent nature, including His ultimate authority and being.",
          "members": [
            "God",
            "God (יהוה)",
            "God יהוה",
            "YHWH",
            "Yahweh",
            "יהוה",
            "God's essential nature and identity",
            "God's authority and essence",
            "God's presence, authority, and essence"
          ],
          "rationale": "These targets directly name God or describe His core, unchanging attributes and identity, emphasizing who God is at His most fundamental level."
        },
        {
          "name": "God's Active Power & Governance",
          "description": "Encompasses God's direct actions, interventions, power, and sovereign rule over creation and history, including His commands and plans.",
          "members": [
            "God's active and forceful power",
            "God's active power, intervention, and protection",
            "God's active execution of judgment",
            "God's active presence and authority",
            "God's active presence and immanence",
            "God's active presence, authority, and self-revelation",
            "God's act of carrying and delivering Israel",
            "God's action of holding accountable",
            "God's action of recompensing",
            "God's action towards Israel",
            "God's direct action/power",
            "God's direct, overwhelming manifestation and communication",
            "God's direct, personal involvement in the Exodus",
            "God's divine governance and relationship with Israel",
            "God's powerful movement and dominion over the cosmos",
            "God's power and active intervention",
            "God's power and active intervention in freeing Israel",
            "God's power and agency",
            "God's power and intervention",
            "God's power/authority",
            "God's power/support",
            "God's manifestation/revelation",
            "God's communication / divine pronouncement",
            "God's word/command/decree",
            "God's divine plans, decrees, or knowledge"
          ],
          "rationale": "This group captures the dynamic aspect of God – His power, intervention, revelation, and the execution of His will through actions, commands, and underlying plans that shape events."
        },
        {
          "name": "God's Relational Presence & Favor",
          "description": "Focuses on God's benevolent relationship with His people, including His care, protection, accessibility, and covenantal commitment.",
          "members": [
            "God's acceptance/pleasure",
            "God's accessibility and responsiveness to the nation",
            "God's favor/presence/protection",
            "God's leadership and presence for the Israelites",
            "God's preparatory and watchful care for Israel",
            "God's presence and authority",
            "God's presence or attention",
            "God's presence, authority, and worship",
            "God's presence, worship, or authority",
            "God's presence/authority",
            "God's presence/person",
            "God's presence/sight",
            "God's promise/covenant",
            "God's protective presence and favor",
            "God's providential care for Israel",
            "God's relationship with Israel",
            "God's unwavering commitment and support to the Israelites",
            "YHWH's authority/presence/person",
            "God's person and authority",
            "God's authority/representation"
          ],
          "rationale": "These targets emphasize God's active engagement in a positive, supportive, and covenantal relationship with humanity, particularly Israel, highlighting His care, accessibility, and protective presence."
        },
        {
          "name": "God's Judgment & Displeasure",
          "description": "Represents aspects of God's righteous anger, assessment, and the consequences of disobedience, including withdrawal of favor and discipline.",
          "members": [
            "God's anger",
            "God's intense anger",
            "YHWH's anger",
            "God's withdrawal of divine favor/presence/protection",
            "יהוה's discipline of Israel",
            "God's awareness/judgment",
            "God's judgment/approval",
            "God's judgment/assessment",
            "God's judgment/perception",
            "God's perception/judgment"
          ],
          "rationale": "This group brings together all expressions of God's negative emotional responses, His acts of judgment, and the consequences of sin or disobedience, including His perception leading to such judgments."
        },
        {
          "name": "False Deities",
          "description": "Refers to entities worshipped as gods but lacking true divine power or authority, often contrasted with the one true God.",
          "members": [
            "False gods/idols"
          ],
          "rationale": "This target stands in direct opposition to the true God and represents a distinct category of non-divine entities that are mistakenly revered, serving as a clear counterpoint."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Targets were analyzed for semantic commonalities and biblical-theological relationships. Grouping prioritized core identity, active engagement, relational aspects, and judgmental attributes, with a distinct category for opposing entities. The goal was to create intuitive, mutually exclusive groups that cover all targets."
    },
    "specific person": {
      "groups": [
        {
          "name": "Prominent Biblical Figures & Leaders",
          "description": "Named individuals who play significant roles in the biblical narrative, often as leaders or key figures.",
          "members": [
            "Joseph",
            "Joshua",
            "Judah",
            "Moses",
            "Caleb",
            "Pharaoh (the enemy king)",
            "Sihon (the enemy king)"
          ],
          "rationale": "These targets represent specific, named individuals who are central to the biblical story, often holding positions of leadership or significant influence."
        },
        {
          "name": "Roles, Offices, and Social Functions",
          "description": "Individuals defined by their societal, legal, or religious function, office, or specific task.",
          "members": [
            "The king/leader of Israel (implied recipient of the promise)",
            "The prophet",
            "The prophet or dream-diviner",
            "The individual executing the law",
            "The witness",
            "The accuser's active participation/responsibility",
            "The person who holds the role of blood-avenger",
            "The Israelite making the offering",
            "The released servant/person"
          ],
          "rationale": "This group encompasses individuals identified by their specific duties, positions, or roles within the community, legal system, or religious practice."
        },
        {
          "name": "Kinship, Family, and Lineage",
          "description": "Individuals defined by their familial relationships, generational connections, or place within a lineage.",
          "members": [
            "The woman",
            "brothers",
            "children",
            "firstborn son",
            "her husband",
            "human offspring/children",
            "parents",
            "the wife",
            "The dead brother's identity, legacy, and lineage",
            "The dead brother's memory, lineage, and continued existence in Israel",
            "the offspring/children of the cursed individual"
          ],
          "rationale": "These targets highlight the importance of family structures, relationships, and the continuity of generations and identity within the biblical context."
        },
        {
          "name": "Individuals by Condition, Status, or Legal Standing",
          "description": "Individuals identified by their specific state, legal status (e.g., victim, perpetrator, protected), or a representative generic individual.",
          "members": [
            "The individual Israelite (the 'you')",
            "An innocent person whose life is taken",
            "The Israelite who takes the forbidden items",
            "The Israelite person being kidnapped",
            "The person being murdered",
            "The hanged person",
            "the guilty one / the one liable for flogging",
            "the person being handed over (the killer)",
            "the afflicted person's body",
            "The individual/nation under God's protection"
          ],
          "rationale": "This group captures individuals based on their circumstances, legal culpability, victimhood, or a general representative status within the community or under divine care."
        },
        {
          "name": "Inner Being, Attributes, and Capacities",
          "description": "Abstract qualities, internal states, specific capacities, or defining characteristics of a person, rather than the person themselves or their role.",
          "members": [
            "Caleb's devotion and obedience",
            "Joshua's internal state and capacity for leadership",
            "Joshua's leadership role",
            "Joshua's role/relationship to Moses",
            "Moses' capacity for leadership and activity",
            "Pharaoh's authority and power",
            "Sihon's inner being (will, emotions, intellect)",
            "Sihon's will/disposition",
            "The Israelite's intense desire",
            "The Israelite's intense request or desire",
            "The individual's inner being (intellect, will, emotions)",
            "The individual's inner self/mind/will",
            "The person's inner self/mind/emotions",
            "The king's moral and spiritual loyalty/will",
            "the woman's extreme delicacy and pampered status",
            "the worker's dependence"
          ],
          "rationale": "This group focuses on the non-physical aspects of individuals, including their character, mental states, emotional drives, inherent abilities, and defining personal qualities."
        }
      ],
      "ungrouped": [],
      "confidence": 1.0,
      "methodology": "Targets were analyzed for semantic similarity, focusing on whether they represent a named individual, a societal/legal/religious role, a familial relationship, a specific condition/status, or an internal attribute/capacity. Five conceptual groups were established to encompass all targets, ensuring each target appeared in exactly one group. Group names and descriptions were crafted for clarity and intuitive understanding, considering biblical and theological contexts."
    },
    "natural world": {
      "groups": [
        {
          "name": "Celestial Expanse & Luminaries",
          "description": "Encompasses the sky, its atmospheric conditions, and the heavenly bodies within it, often linked to divine activity or signs.",
          "members": [
            "Celestial bodies (stars, planets)",
            "The heavens (as source of divine provision)",
            "The heavens",
            "The skies/rain cessation",
            "The sky/heavens",
            "The sun, moon, and stars"
          ],
          "rationale": "These targets all refer to the upper realm, the visible sky, and the objects that inhabit it, including their role in weather patterns and divine interaction or manifestation."
        },
        {
          "name": "Terrestrial Foundation & Waters",
          "description": "Refers to the physical ground in its various forms, along with the essential water sources that sustain it.",
          "members": [
            "The earth",
            "The earth's surface",
            "The earth/ground",
            "The surface of the earth",
            "The deep (subterranean waters)",
            "Rain of the land"
          ],
          "rationale": "This group consolidates terms describing the physical ground and the vital water elements (both from above as rain and from below as subterranean waters) that are intrinsically linked to its existence and sustenance."
        },
        {
          "name": "Land's Fertility & Sustenance",
          "description": "Represents the productive capacity of the land, its agricultural output, and the livestock it supports, signifying provision and prosperity.",
          "members": [
            "The productivity of the land",
            "Agricultural bounty and prosperity",
            "Agricultural produce/harvest",
            "The wheat",
            "Trees of the field",
            "Choicest produce/resources from the mountains",
            "Offspring of cattle/livestock",
            "The lambs (their quality)"
          ],
          "rationale": "These targets collectively describe the fruitfulness and yield of the land, encompassing crops, trees, and animals, which are fundamental sources of food, wealth, and overall sustenance in a biblical context."
        },
        {
          "name": "Natural Calamities & Destructive Forces",
          "description": "Groups natural phenomena that pose threats, cause damage, or bring about destruction and hardship.",
          "members": [
            "The cricket/insect infestation",
            "Pestilence",
            "Destructive power of wild animals",
            "The height/extent of the fire"
          ],
          "rationale": "These targets all represent negative, destructive aspects of the natural world, often depicted as judgments, curses, or significant challenges to human and animal life."
        },
        {
          "name": "Universal Totality & Scope",
          "description": "Expressions used to denote the entirety of creation, all things, or a comprehensive scope of existence.",
          "members": [
            "Everything/all things/the entire land/all people",
            "Heaven and earth"
          ],
          "rationale": "These targets function as merisms or comprehensive terms to refer to the whole of existence, the complete scope of creation, or a full set of entities, emphasizing universality."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "The grouping approach involved an iterative process of identifying semantic clusters among the provided targets. Similar terms were consolidated, and targets were assigned to groups based on their primary conceptual relationship within a biblical 'natural world' context. Emphasis was placed on creating intuitive, distinct categories that reflect common biblical usage patterns and theological implications, ensuring all targets were uniquely placed."
    }
  },
  "vehicle_groupings": {
    "spatial": {
      "groups": [
        {
          "name": "Paths, Movement, and Deviation",
          "description": "Vehicles representing linear progression, journeys, and any departure or return along a defined course or direction.",
          "members": [
            "A physical path or road",
            "A physical path/road",
            "A physical road or route",
            "A physical road/path",
            "A physically crooked or twisted path/object",
            "A physically twisted or tangled object/path",
            "Physical deviation from a straight path (turning right or left)",
            "a physical object (the heart) deviating from a straight path",
            "a physical path/road",
            "a physical road/path",
            "physical deviation from a straight path",
            "physical movement along a path",
            "physical movement along a path or way",
            "fleeing by seven roads",
            "directions (right and left)",
            "physical movement back to a place or person",
            "physical return",
            "physical prolongation or extension"
          ],
          "rationale": "These vehicles all relate to the concept of a 'way' or 'road' – whether literal or metaphorical – and the actions of moving along it, turning from it, or returning to it. They often signify life's course, moral choices, or the progression of events."
        },
        {
          "name": "Proximity, Presence, and Frontal Position",
          "description": "Vehicles indicating being near, in front of, or in the immediate presence of someone or something, often emphasizing the 'face' as a point of reference or authority.",
          "members": [
            "Being 'before the face' or 'at the head'",
            "Being physically before the face of an authority",
            "Being physically in front of someone/something",
            "Being removed from one's immediate presence/front",
            "Placing something physically before someone",
            "Placing something physically in front of someone's face/presence",
            "Something physically resting 'upon' someone",
            "before / in front of",
            "before one's face/presence",
            "being 'upon the face of' or 'before the presence of'",
            "being before a face",
            "being before the face of a physical entity",
            "being in front of someone",
            "being in front of someone's face/eyes",
            "being physically before someone's face",
            "being physically in front of a face",
            "being physically in front of someone",
            "being physically in front of someone's face",
            "being positioned 'in front of' or 'at the head' of a group",
            "from one's face/presence",
            "from the face/presence",
            "physical closeness/proximity",
            "physical position ahead of someone",
            "physical proximity",
            "physical removal from a path or presence",
            "placing before",
            "placing something before one's face",
            "placing something before someone's face",
            "spatial front ('before')",
            "spatial proximity ('before')",
            "standing before a physical entity",
            "standing physically in front of someone's face",
            "to the face / in front of",
            "face/presence as a spatial reference or barrier"
          ],
          "rationale": "These vehicles consistently refer to the spatial relationship of being 'before' or 'in front of' another entity, often implying direct encounter, submission, authority, or immediate awareness. The 'face' is a recurring element, signifying direct presence or attention."
        },
        {
          "name": "Elevation, Depth, and Verticality",
          "description": "Vehicles describing positions or movements along the vertical axis, indicating height, lowness, ascent, or descent.",
          "members": [
            "Being physically high or above",
            "Physical ascent/elevation",
            "Physical descent/sinking",
            "Physical elevation/height",
            "top and bottom (spatial positions)",
            "reaching the sky/heavens",
            "the heavens/sky as a point of extreme height"
          ],
          "rationale": "This group captures concepts related to vertical spatial orientation, whether it's a static position (high/low) or dynamic movement (ascending/descending). These often metaphorically represent status, power, or spiritual states."
        },
        {
          "name": "Internal Spaces and Midst",
          "description": "Vehicles referring to the inner part, center, or being surrounded by a group or entity.",
          "members": [
            "Inward part/midst (of a body or entity)",
            "Inward part/midst",
            "inward part/midst of a body or object",
            "midst of brothers",
            "physical location 'in the midst'",
            "the 'midst' or 'inner part' of a physical entity",
            "the physical 'inward part' or 'midst'",
            "physical presence among a group"
          ],
          "rationale": "These vehicles all denote an internal or central position, whether within a physical object, a body, or a social group. They often signify intimacy, core identity, or being encompassed."
        },
        {
          "name": "Boundaries, Extremes, and General Locales",
          "description": "Vehicles representing specific locations, general areas, or the conceptual and physical limits/extent of a space.",
          "members": [
            "The gates of the town",
            "city and country/field (representing all locations/circumstances)",
            "city gates",
            "contrasting geographical locations (city and country/field)",
            "extreme geographical limits",
            "the conceptual boundaries or extremities of the sky/heaven",
            "the extreme edge of the visible sky/heavens",
            "the literal ends/edges of the earth",
            "the physical boundaries or extreme points of the earth/land",
            "area under the sky",
            "under heaven/sky",
            "under the heavens",
            "physical distance (far/near)"
          ],
          "rationale": "This group encompasses vehicles that define the extent, limits, or specific significant points within a geographical or cosmic space. They represent the scope of a situation, the reach of influence, or distinct places of activity."
        }
      ],
      "ungrouped": [
        "Days approaching"
      ],
      "confidence": 0.95,
      "methodology": "Vehicles were analyzed for their core spatial meaning and function in figurative language. Groupings were formed based on shared semantic domains such as linear movement, relative position/presence, vertical orientation, internal location, and spatial boundaries/extent. The goal was to create intuitive categories that reflect how these spatial concepts are employed metaphorically in biblical Hebrew. 'Days approaching' was left ungrouped as its primary figurative function is temporal, despite using a spatial verb."
    },
    "created objects": {
      "groups": [
        {
          "name": "Dwellings & Enclosures",
          "description": "Structures or parts of structures that define a place of habitation, security, or entry/exit.",
          "members": [
            "Physical house/dwelling",
            "The physical house/dwelling",
            "The physical house",
            "a house",
            "a physical house",
            "physical construction of a house",
            "the physical dwelling place ('house')",
            "tent",
            "tents",
            "City gates",
            "The city gate",
            "The city gates",
            "city gate",
            "city gates",
            "gate",
            "gates",
            "physical house"
          ],
          "rationale": "These vehicles represent places of residence, community, protection, or access. In biblical contexts, they often symbolize a family, a nation, a spiritual state, or a boundary."
        },
        {
          "name": "Tools, Weapons & Implements",
          "description": "Manufactured items designed for specific actions, defense, offense, measurement, or capture.",
          "members": [
            "Sword",
            "Mouth/edge of a sword",
            "Shield",
            "Shield/shelter",
            "rope/cord (used for measuring)",
            "snare/trap",
            "physical arrows"
          ],
          "rationale": "These objects are used to exert force, provide protection, define boundaries, or ensnare. Figuratively, they represent power, judgment, divine protection, or instruments of divine will/human action."
        },
        {
          "name": "Valuables, Provisions & Containers",
          "description": "Items of worth, sustenance, or the vessels and places used to hold or distribute them.",
          "members": [
            "A treasure/special possession",
            "Storehouse/treasury",
            "valuable possession/treasure",
            "a king's private treasure/valuable possession",
            "a portion, share, or inheritance",
            "an allotment, measured portion, or inheritance",
            "inheritance/property",
            "bread",
            "unleavened bread",
            "bread and clothing",
            "basket and kneading bowl",
            "basket; kneading bowl",
            "A container being full"
          ],
          "rationale": "These vehicles relate to wealth, sustenance, blessings, and the means of holding or distributing resources. They often symbolize divine provision, destiny, or spiritual nourishment."
        },
        {
          "name": "Materials & Components",
          "description": "Basic substances or building blocks used in construction or manufacturing.",
          "members": [
            "Wood and stone",
            "materials (wood and stone)",
            "iron",
            "iron (the material)",
            "copper",
            "iron and copper doorbolts"
          ],
          "rationale": "These represent the fundamental elements from which things are made. Figuratively, they can symbolize strength, durability, the raw components of a people or structure, or the nature of a kingdom."
        },
        {
          "name": "Symbols, Words & Markers",
          "description": "Objects or linguistic constructs whose primary function is to communicate, identify, or serve as a reminder or representation.",
          "members": [
            "A name/word",
            "a byword/taunt",
            "a proverb/saying",
            "individual written words",
            "a physical sign bound on the hand",
            "physical frontlets/symbols on the forehead"
          ],
          "rationale": "These vehicles convey meaning, identity, or a message. They are used to represent reputation, wisdom, a covenant, or a constant reminder of divine law or judgment."
        },
        {
          "name": "Burdens & Constraints",
          "description": "Objects or places that signify restriction, servitude, oppression, or heavy responsibility.",
          "members": [
            "A physical load/weight",
            "An iron yoke placed upon a neck",
            "a house associated with servitude",
            "a house of slaves/prison",
            "house of bondage",
            "a physical house or dwelling place for slaves"
          ],
          "rationale": "These vehicles represent states of oppression, servitude, or a heavy responsibility. They are used metaphorically to describe bondage, divine judgment, or difficult circumstances."
        }
      ],
      "ungrouped": [
        "a physical object being crushed or broken"
      ],
      "confidence": 0.95,
      "methodology": "Vehicles were grouped based on their primary semantic and functional domains in biblical Hebrew figurative language. Categories were developed iteratively, focusing on how these 'created objects' are typically employed metaphorically (e.g., as dwellings, tools, valuables, materials, symbols, or burdens). The goal was to create distinct, intuitive groups with clear descriptive names and rationales, ensuring each vehicle was placed in exactly one group or designated as unique."
    },
    "human parts": {
      "groups": [
        {
          "name": "The Inner Core: Emotion, Will, and Life-Force",
          "description": "Vehicles representing the seat of thought, feeling, decision, life itself, and internal disposition, often used to convey spiritual or psychological states.",
          "members": [
            "A physically stiff neck",
            "Blood",
            "Breath/soul/life-force",
            "Bringing something back to the heart (as a physical organ)",
            "Heart (as the innermost/central part)",
            "Heart and soul",
            "Heart and soul (as centers of will, emotion, life)",
            "Heart and soul (as components of a person's inner and outer being)",
            "Innocent blood",
            "Numbness of the physical heart",
            "Physical blood",
            "Physical heart",
            "The soul (nefesh) asking/requesting",
            "The soul (nefesh) desiring",
            "The soul/nefesh's desire",
            "The life-force",
            "The self",
            "a physical heart becoming soft/tender",
            "a physical heart melting",
            "a stiff/hard neck",
            "blood",
            "bosom",
            "bosom (חֵיק)",
            "bosom/lap",
            "entire inner and outer being (represented by heart and soul)",
            "flesh",
            "goodness of the heart (לֵבָב)",
            "heart",
            "heart and soul",
            "heart and soul (as physical organs)",
            "heart and soul (inner faculties)",
            "heart and soul/self as receptacles",
            "heart/mind (לב)",
            "inward part/midst of a body",
            "kidney fat (of an animal)",
            "loins",
            "melting of heart",
            "physical heart",
            "physical heart becoming hard",
            "physical heart turning",
            "physical objects departing from the heart",
            "physical thickness/grossness",
            "placing something physically 'upon the heart'",
            "softness of heart",
            "soul (nefesh)",
            "soul (נֶפֶשׁ)",
            "soul / life-breath (nefesh)",
            "soul/life (nafesh)",
            "soul/life (נֶפֶשׁ)",
            "soul/life (נפש)",
            "soul/life-breath (nefesh)",
            "souls/lives (נֶפֶשׁ)",
            "stiff/hard neck",
            "stubbornness of heart",
            "the physical heart"
          ],
          "rationale": "These vehicles primarily represent internal states, emotions, will, life principle, or the core identity of a person. They are often used to describe spiritual or psychological conditions rather than direct physical actions or external appearances."
        },
        {
          "name": "The Agents of Action: Power, Agency, and Movement",
          "description": "Vehicles representing the means by which a person acts, exerts power, moves, supports, or directs, including their capacity or lack thereof.",
          "members": [
            "Empty hands",
            "Hand",
            "Hand (as instrument of work)",
            "Hand receiving an object",
            "Hands",
            "Hands and their work",
            "Heads",
            "Sending forth/stretching out the hand",
            "Steps/feet",
            "The hand",
            "The head of a body",
            "The physical head",
            "a foot faltering",
            "a hand",
            "a human arm, outstretched",
            "a human hand",
            "a strong hand",
            "a strong human hand",
            "a strong/mighty hand",
            "an extended human arm",
            "an outstretched human arm",
            "arms",
            "at their feet",
            "crown of the head",
            "feet",
            "finger",
            "foot",
            "hand",
            "hand (sending forth)",
            "hand lacking strength",
            "hands",
            "head",
            "head and tail (body parts)",
            "head/top (ראש)",
            "human arm (outstretched)",
            "outstretched arm",
            "physical hand",
            "physical hand being closed",
            "physical head",
            "right hand",
            "shoulders of God",
            "sole of foot and crown of head",
            "teeth/fangs",
            "the physical hand and its 'sending forth'",
            "the physical head"
          ],
          "rationale": "This group encompasses body parts primarily associated with physical action, strength, control, movement, leadership (head), support (shoulders), or the lack of these capacities (empty hands, hand lacking strength). They are the instruments of doing and being in the world."
        },
        {
          "name": "The Channels of Perception, Expression, and Presence",
          "description": "Vehicles representing how a person perceives the world, communicates, and presents themselves, including sensory organs, means of vocalization, and outward appearance/identity.",
          "members": [
            "A human voice",
            "Burning of the nose/face",
            "Ears",
            "Eye",
            "Eyes",
            "Eyes/sight",
            "Face",
            "Face (as 'strong/bold')",
            "Face (פָּנֶה)",
            "Face (פָּנִים)",
            "Face (פנים)",
            "Face/physical proximity",
            "Mouth",
            "Nakedness",
            "Seeing, hearing, eating, smelling (as human actions/capacities)",
            "The physical act of seeing with one's eyes",
            "The physical mouth",
            "Voice/sound",
            "Voice/sound (קול)",
            "a mouth and the action of opening it",
            "audible human-like voice",
            "burning nose",
            "burning nose/flaring nostrils",
            "burning/flaring nose/nostril",
            "ears (אוזניים)",
            "evil eye",
            "eye",
            "eyes",
            "eyes (human sensory organ)",
            "eyes (physical location relative to)",
            "eyes (עיניים)",
            "eyes and blinding",
            "eyes experiencing hardness",
            "eyes pining/yearning",
            "eyes/sight",
            "face",
            "face (פָּנִים)",
            "face (פָּנִים)",
            "face (פנים)",
            "face of a man",
            "face/front",
            "face/presence",
            "faces",
            "faces (used spatially)",
            "faces/presence",
            "finding favor in eyes",
            "foreskin",
            "hiding one's face",
            "human eyes",
            "human eyes fixed on something",
            "human eyes/sight",
            "human voice",
            "lip",
            "lips",
            "lifting eyes",
            "mouth",
            "mouth (פִּ֤י)",
            "mouth of the sword",
            "mouth's utterance",
            "nose/nostril",
            "nostril",
            "physical eyes/presence before eyes",
            "physical face",
            "physical sight (eyes)",
            "space between eyes",
            "standing in the physical presence or sight of an authority figure's face",
            "the 'evil eye'",
            "the eye",
            "the physical 'face' or 'presence' of the subject",
            "the pupil of an eye",
            "two faces in direct proximity",
            "voice",
            "voice (sound)"
          ],
          "rationale": "This group focuses on the body parts that serve as interfaces with the external world: sensory input (eyes, ears, nose), vocal output (mouth, voice), and outward presentation or identity (face, nakedness, foreskin). They are crucial for perception, communication, and conveying one's presence or state to others."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "The grouping process involved an initial scan of all vehicles to identify recurring themes and primary figurative functions. Three core semantic domains emerged: the internal/emotional/life-giving aspects, the active/agentic/powerful aspects, and the perceptive/expressive/presentational aspects. Each vehicle was then assigned to the group that best represented its most common or salient figurative usage in biblical Hebrew. Care was taken to ensure every vehicle was placed in exactly one group, prioritizing functional similarity over mere anatomical location. Group names and descriptions were crafted to be intuitive and reflect these functional domains."
    },
    "relationships": {
      "groups": [
        {
          "name": "Direct Familial Bonds",
          "description": "Vehicles representing immediate blood relations, lineage, and the fundamental structure of a family unit, establishing direct descent or siblinghood.",
          "members": [
            "Direct offspring/children",
            "Fathers / Ancestors",
            "Sons / Descendants",
            "a literal biological sibling",
            "biological brother",
            "children in a family",
            "human father"
          ],
          "rationale": "These terms denote direct biological or ancestral connections, forming the basic building blocks of family and lineage in biblical thought. They establish who is related to whom by birth or direct descent."
        },
        {
          "name": "Parental Nurture & Authority",
          "description": "Vehicles highlighting the specific responsibilities, actions, and authority of a parent, particularly a father, in guiding, protecting, and shaping their offspring.",
          "members": [
            "A human father disciplining his son",
            "a father carrying his son"
          ],
          "rationale": "These vehicles describe the active, functional aspects of parenthood, emphasizing care, guidance, and the exercise of authority within the parent-child relationship, often used metaphorically for divine interaction."
        },
        {
          "name": "Attribution of Nature or Destiny",
          "description": "Vehicles employing the 'son of X' idiom to metaphorically attribute a defining characteristic, quality, or fate to an individual or group, indicating their inherent nature or belonging to a specific class.",
          "members": [
            "Being 'sons of strength/valor'",
            "Sons of worthlessness/wickedness",
            "son of beating/flogging"
          ],
          "rationale": "In biblical Hebrew, 'son of X' often signifies not just parentage but a deep identification with a quality, profession, or destiny. These terms are functionally similar in their metaphorical usage to describe inherent character or outcome."
        },
        {
          "name": "Defined Social & Civic Status",
          "description": "Vehicles representing specific roles, statuses, or functions within a broader community or society, often carrying associated responsibilities, authority, or vulnerability beyond immediate family ties.",
          "members": [
            "a person acting as a witness",
            "an earthly king",
            "individual social categories (Levite, stranger, fatherless, widow)",
            "man of God (as a title/role)"
          ],
          "rationale": "These terms define a person's position, function, or identity within the larger social, legal, or religious fabric of a community, distinct from their direct familial relationships, and often carry specific societal implications."
        }
      ],
      "ungrouped": [
        "shut up (bound/restrained) and left (free/abandoned)"
      ],
      "confidence": 0.95,
      "methodology": "Vehicles were grouped based on their primary semantic domain and functional similarity in figurative usage within biblical Hebrew. The approach prioritized identifying core relationship types (kinship, parental action, character attribution, societal role) to create distinct conceptual categories. Any vehicle not fitting these relationship-centric domains was placed in 'ungrouped'."
    },
    "social group": {
      "groups": [
        {
          "name": "Formidable Adversaries & Obstacles",
          "description": "Entities representing significant opposition, overwhelming challenges, or imposing threats, often serving as targets for divine judgment or human conquest.",
          "members": [
            "The Anakites (specifically their height)",
            "The nations (their destruction)"
          ],
          "rationale": "Both vehicles represent large-scale, powerful entities that pose significant threats or obstacles. The Anakites' extraordinary height emphasizes their overwhelming physical presence and the fear they inspire, functioning as a formidable barrier. 'The nations' collectively represent a formidable political and military opposition, often depicted as enemies of God or Israel, whose ultimate destruction signifies divine judgment and the removal of opposition. In both cases, they function metaphorically as symbols of challenges that require divine or heroic intervention to overcome."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "The two provided 'social group' vehicles were analyzed for their common metaphorical functions in biblical contexts. Both were found to represent large-scale, imposing entities that serve as significant challenges or adversaries. Their shared role as formidable obstacles or targets of divine action led to their grouping into a single conceptual category."
    },
    "time": {
      "groups": [
        {
          "name": "Temporal Extent & Duration",
          "description": "Vehicles that refer to the overall span, length, or totality of a period, often a lifetime or a significant stretch of time.",
          "members": [
            "all the days of one's life",
            "totality of days",
            "length of days",
            "Lengthening days",
            "Lengthening of days",
            "days"
          ],
          "rationale": "These vehicles collectively describe the extent or continuation of time, from a general 'days' to the full 'totality of days' or the 'lengthening' of a period, often implying a life span or a significant era."
        },
        {
          "name": "Intra-Day Markers & Transitions",
          "description": "Vehicles that pinpoint specific moments, segments, or shifts within the 24-hour daily cycle, often highlighting routine, change, or a desired temporal state.",
          "members": [
            "The end of a day",
            "The next day",
            "night and day (parts of a day)",
            "wishing for the opposite time of day (morning for evening, evening for morning)",
            "lying down/getting up"
          ],
          "rationale": "This group captures the dynamic aspects of a single day, marking its beginning, end, internal divisions, or the desire to alter its natural progression. 'Lying down/getting up' are actions that inherently mark the transition between evening and morning."
        },
        {
          "name": "Chronological Anchors & Reference Points",
          "description": "Vehicles that function as markers to establish a position in the linear flow of time, relating events to the past or present from a specific vantage point.",
          "members": [
            "specific past days (yesterday and the day before)",
            "yesterday and the day before yesterday",
            "the present day",
            "temporal marker 'until this day'"
          ],
          "rationale": "These vehicles serve to orient the speaker or narrative within a timeline, pointing to specific moments in the past, the current moment, or a continuous period leading up to the present."
        }
      ],
      "ungrouped": [
        "home/away"
      ],
      "confidence": 0.95,
      "methodology": "The grouping process involved identifying semantic commonalities among the provided time vehicles. Initial categorization focused on whether vehicles referred to overall duration, specific points within a daily cycle, or chronological reference points. Duplicates were consolidated, and ambiguous items like 'specific times and locations' were analyzed to isolate their purely temporal components ('lying down/getting up'), with non-temporal elements ('home/away') moved to the ungrouped category. The goal was to create distinct, intuitive groups that highlight functional and semantic similarities in how these concepts operate as figurative vehicles for time."
    },
    "specific person": {
      "groups": [
        {
          "name": "Figures of Consequence and Loss",
          "description": "This group encompasses specific individuals or general states that, in their figurative usage, represent a significant decline, defeat, or the negative outcome of actions or circumstances. They serve as markers of what has been overcome, lost, or rendered ineffective.",
          "members": [
            "Sihon the king",
            "The patriarch Reuben",
            "the dead person/corpse"
          ],
          "rationale": "All three vehicles, when used figuratively, point to a state of being overcome, diminished, or having suffered a significant negative outcome. Sihon represents a formidable external enemy decisively defeated; Reuben represents a figure who lost preeminent status due to personal moral failure; and the dead person/corpse represents the ultimate state of lifelessness, decay, and the consequence of mortality or spiritual separation. They all embody a form of 'loss' or 'consequence' that serves as a powerful metaphorical reference."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Each vehicle was analyzed for its primary metaphorical function in biblical contexts, focusing on what it represents beyond its literal meaning. A common semantic domain of 'defeat,' 'decline,' 'loss of status,' or 'negative consequence' was identified across all three, allowing them to be grouped into a single, cohesive category that highlights their shared functional and semantic properties in figurative language."
    },
    "geographical or political entity": {
      "groups": [
        {
          "name": "Identifiable Nations & Territories",
          "description": "Vehicles representing specific, named national entities or their geographical extent, often used to symbolize the nation's people, power, or role in a narrative.",
          "members": [
            "The physical land of Egypt",
            "the physical territory of Egypt"
          ],
          "rationale": "These vehicles are functionally identical, referring to the specific geographical and political entity of Egypt. They represent a concrete, identifiable nation-state, distinct from general political structures or smaller, localized markers. Their figurative use often evokes the entire nation's character or destiny."
        },
        {
          "name": "Named Localities & Strategic Centers",
          "description": "Vehicles representing specific, named geographical points or urban settlements that function as markers for regions, boundaries, or concentrated centers of human activity, power, and identity.",
          "members": [
            "Gilead and Dan (as boundaries)",
            "The city (as a physical and political entity)"
          ],
          "rationale": "Both 'Gilead and Dan' and 'The city' are specific, named locations. 'Gilead and Dan' function as geographical markers defining extent or region, often symbolizing the limits or a particular area. 'The city' functions as a concentrated center of population, political power, defense, and culture. They share the property of being concrete, named places that carry significant symbolic weight beyond their mere physical presence, representing a community, a stronghold, or a defined area."
        }
      ],
      "ungrouped": [
        "kingdoms"
      ],
      "confidence": 0.95,
      "methodology": "Semantic domain analysis, focusing on the level of specificity (specific nation vs. specific place vs. general concept) and functional role in figurative language (boundary, center of power, national identity, abstract rule). Vehicles were grouped based on shared characteristics in how they function metaphorically."
    },
    "warfare": {
      "groups": [
        {
          "name": "Instruments of Conflict and Judgment",
          "description": "Vehicles representing the direct tools of warfare, often symbolizing divine judgment, destructive power, or the act of conflict itself.",
          "members": [
            "A sharpened, flashing sword",
            "the sword (as an instrument of warfare/execution)"
          ],
          "rationale": "Both vehicles refer to the primary weapon of ancient warfare. 'The sword' is the general concept, while 'a sharpened, flashing sword' emphasizes its readiness, deadliness, and often its role in swift, decisive judgment or destruction, making them functionally and semantically similar in their figurative use."
        },
        {
          "name": "Collective Military Force and Scale",
          "description": "Vehicles representing the assembled body of combatants, emphasizing their numbers, overwhelming presence, or the sheer magnitude of a military threat.",
          "members": [
            "Army/host/multitude",
            "an army or host",
            "exaggerated numbers in battle"
          ],
          "rationale": "These vehicles all pertain to the collective body of soldiers. 'Army/host/multitude' and 'an army or host' are direct references to a fighting force. 'Exaggerated numbers in battle' amplifies this concept, highlighting the overwhelming scale or power of such a force, often used to convey inevitability or immense threat."
        },
        {
          "name": "Strategic Military Assets and Power",
          "description": "Vehicles representing key components or advanced technologies of ancient warfare that signify power, speed, mobility, and strategic advantage.",
          "members": [
            "horses and chariots"
          ],
          "rationale": "Horses and chariots were not just individual weapons but crucial strategic assets in ancient warfare, representing speed, mobility, and significant military might. They often symbolize a nation's military strength, technological superiority, or the swiftness of an invading force."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Vehicles were analyzed for their core semantic and functional properties within a 'warfare' context. Grouping prioritized how these elements are typically used metaphorically in biblical texts: as direct instruments of action, as representations of collective power/scale, or as symbols of strategic military capability. The goal was to create distinct yet related conceptual categories that enhance visualization clarity."
    },
    "the ancient workplace": {
      "groups": [
        {
          "name": "Menial Labor & Servitude",
          "description": "Vehicles representing basic, often arduous or forced, human labor and a position of low status or service.",
          "members": [
            "Woodchopper and waterdrawer"
          ],
          "rationale": "Both roles are archetypes of basic, physically demanding, and often subservient labor. In biblical contexts, they frequently denote a state of subjugation, a curse, or the lowest rung of society, emphasizing the burden of service or the consequences of defeat."
        },
        {
          "name": "Intense Processing & Refinement",
          "description": "Vehicles involving significant physical force, heat, or pressure to transform raw materials, often resulting in purification, separation, or a refined product.",
          "members": [
            "iron blast furnace",
            "threshing floor",
            "vat (winepress/oil press)"
          ],
          "rationale": "The iron blast furnace uses intense heat for purification and shaping; the threshing floor separates grain from chaff through beating and winnowing; the vat crushes grapes or olives under pressure to extract liquid. All are processes of transformation involving significant stress or separation, often used metaphorically in biblical texts for divine judgment, purification, severe testing, or the suffering of individuals/nations that leads to a refined outcome or separation."
        }
      ],
      "ungrouped": [
        "economic transaction of sale"
      ],
      "confidence": 0.95,
      "methodology": "Vehicles were analyzed for their primary functional and semantic properties, particularly their common metaphorical usage in biblical contexts. Groupings were formed based on shared themes of human labor/status, or intense material processing/transformation. The 'economic transaction of sale' was deemed unique among the given list due to its focus on abstract exchange and value rather than physical labor or material processing."
    },
    "state of being": {
      "groups": [
        {
          "name": "State of Unblemished Purity",
          "description": "This group represents a condition of being intact, uncorrupted, and whole, often signifying faithfulness, integrity, or a pristine beginning.",
          "members": [
            "Virginity"
          ],
          "rationale": "Metaphorically, 'virginity' in biblical contexts often denotes a nation's loyalty to God, freedom from idolatry, or an unblemished state of being, distinct from states of defilement or decay. It emphasizes integrity and potential, making it functionally unique among the given vehicles."
        },
        {
          "name": "State of Internal Decay and Sickness",
          "description": "This group encompasses conditions characterized by internal corruption, weakness, and a progressive decline, often leading to a need for healing or restoration.",
          "members": [
            "a living being suffering from illness"
          ],
          "rationale": "'Illness' serves as a powerful metaphor for sin, spiritual brokenness, national decline due to disobedience, or a state of internal corruption that requires divine intervention and healing. Its focus is on an internal, deteriorating condition, making it functionally unique in its specific metaphorical domain."
        },
        {
          "name": "State of Desperate Lack and Longing",
          "description": "This group represents a condition of severe deficiency, emptiness, or barrenness, leading to an urgent need for external provision, sustenance, or refreshment.",
          "members": [
            "thirst/drought"
          ],
          "rationale": "'Thirst/Drought' metaphorically depicts spiritual emptiness, a longing for God's presence or word, or a land under judgment due to a lack of divine blessing. It highlights an external, existential need for vital resources, making it functionally unique in its specific metaphorical domain."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "Each vehicle was analyzed for its primary metaphorical function and semantic domain within biblical Hebrew. Given the small set of vehicles and the requirement for 3-6 groups, each vehicle was identified as 'truly unique' in its specific 'state of being' representation (purity, internal decay, external lack), justifying the creation of three distinct conceptual groups, each with a single member."
    },
    "other": {
      "groups": [
        {
          "name": "States of Vulnerability and Exposure",
          "description": "This group encompasses human conditions characterized by extreme helplessness, lack of protection, and susceptibility to harm, shame, or judgment.",
          "members": [
            "extremes of human life (infant and elderly)",
            "physical state of nakedness"
          ],
          "rationale": "Both 'extremes of human life' (infant and elderly) and 'physical state of nakedness' metaphorically represent a profound state of weakness, dependence, lack of defense, or public shame/exposure. Infants and the elderly are inherently vulnerable, dependent, and often lack power or agency. Nakedness directly signifies a lack of covering, protection, and often implies shame, humiliation, or being exposed to judgment, mirroring the defenselessness of the very young and very old."
        }
      ],
      "ungrouped": [],
      "confidence": 0.95,
      "methodology": "The two provided vehicles were analyzed for their core semantic and functional properties in figurative usage. A strong overlap was identified around themes of vulnerability, helplessness, lack of protection, and exposure. A single conceptual group was formed to encompass both, as this allowed for a group with 2+ members and accurately reflected their shared metaphorical functions, adhering to the grouping guidelines."
    }
  }
}